Switch>enable
Switch#
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Switch(config)#hostname test
test(config)#
test(config)#
test(config)#hostname TestSwitch
TestSwitch(config)#
TestSwitch(config)#
TestSwitch(config)#username admin password cisco
TestSwitch(config)#
TestSwitch(config)#enable password cisco
TestSwitch(config)#
TestSwitch(config)#service password-encryption
TestSwitch(config)#
TestSwitch(config)#line console 0
TestSwitch(config-line)#
TestSwitch(config-line)#
TestSwitch(config-line)#password cisco
TestSwitch(config-line)#
TestSwitch(config-line)#login
TestSwitch(config-line)#
TestSwitch(config-line)#exit
TestSwitch(config)#
TestSwitch(config)#exit
TestSwitch#
%SYS-5-CONFIG_I: Configured from console by console

TestSwitch#write memory 
Building configuration...
[OK]
TestSwitch#
TestSwitch#
TestSwitch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
TestSwitch(config)#
TestSwitch(config)#
TestSwitch(config)#vlan 10
TestSwitch(config-vlan)#
TestSwitch(config-vlan)#
TestSwitch(config-vlan)#exit
TestSwitch(config)#
TestSwitch(config)#vlan 20
TestSwitch(config-vlan)#
TestSwitch(config-vlan)#exit
TestSwitch(config)#
TestSwitch(config)#
TestSwitch(config)#int f0/1
TestSwitch(config-if)#
TestSwitch(config-if)#
TestSwitch(config-if)#switchport mode access
TestSwitch(config-if)#
TestSwitch(config-if)#switchport access vlan 10
TestSwitch(config-if)#
TestSwitch(config-if)#exit
TestSwitch(config)#
TestSwitch(config)#int f0/2
TestSwitch(config-if)#
TestSwitch(config-if)#
TestSwitch(config-if)#switchport mode access
TestSwitch(config-if)#
TestSwitch(config-if)#switchport access vlan 10
TestSwitch(config-if)#
TestSwitch(config-if)#
TestSwitch(config-if)#exit
TestSwitch(config)#int f0/3
TestSwitch(config-if)#
TestSwitch(config-if)#switchport mode access
TestSwitch(config-if)#
TestSwitch(config-if)#switchport access vlan 20
TestSwitch(config-if)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan20, changed state to up

TestSwitch(config-if)#
TestSwitch(config-if)#
TestSwitch(config-if)#exit
TestSwitch(config)#
TestSwitch(config)#
TestSwitch(config)#int f0/4
TestSwitch(config-if)#
TestSwitch(config-if)#
TestSwitch(config-if)#switchport mode access
TestSwitch(config-if)#
TestSwitch(config-if)#switchport access vlan 20
TestSwitch(config-if)#end
TestSwitch#
%SYS-5-CONFIG_I: Configured from console by console

TestSwitch#
TestSwitch#write memory
Building configuration...
[OK]
TestSwitch#
TestSwitch#
TestSwitch#