Switch>enable
Switch#
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Switch(config)#hostname test
test(config)#
test(config)#
test(config)#hostname TestSwitch
TestSwitch(config)#
TestSwitch(config)#
TestSwitch(config)#username admin password cisco
TestSwitch(config)#
TestSwitch(config)#enable password cisco
TestSwitch(config)#
TestSwitch(config)#service password-encryption
TestSwitch(config)#
TestSwitch(config)#line console 0
TestSwitch(config-line)#
TestSwitch(config-line)#
TestSwitch(config-line)#password cisco
TestSwitch(config-line)#
TestSwitch(config-line)#login
TestSwitch(config-line)#
TestSwitch(config-line)#exit
TestSwitch(config)#
TestSwitch(config)#exit
TestSwitch#
%SYS-5-CONFIG_I: Configured from console by console

TestSwitch#write memory 
Building configuration...
[OK]
TestSwitch#
TestSwitch#
TestSwitch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
TestSwitch(config)#
TestSwitch(config)#
TestSwitch(config)#vlan 10
TestSwitch(config-vlan)#
TestSwitch(config-vlan)#
TestSwitch(config-vlan)#exit
TestSwitch(config)#
TestSwitch(config)#vlan 20
TestSwitch(config-vlan)#
TestSwitch(config-vlan)#exit
TestSwitch(config)#
TestSwitch(config)#
TestSwitch(config)#int f0/1
TestSwitch(config-if)#
TestSwitch(config-if)#
TestSwitch(config-if)#switchport mode access
TestSwitch(config-if)#
TestSwitch(config-if)#switchport access vlan 10
TestSwitch(config-if)#
TestSwitch(config-if)#exit
TestSwitch(config)#
TestSwitch(config)#int f0/2
TestSwitch(config-if)#
TestSwitch(config-if)#
TestSwitch(config-if)#switchport mode access
TestSwitch(config-if)#
TestSwitch(config-if)#switchport access vlan 10
TestSwitch(config-if)#
TestSwitch(config-if)#
TestSwitch(config-if)#exit
TestSwitch(config)#int f0/3
TestSwitch(config-if)#
TestSwitch(config-if)#switchport mode access
TestSwitch(config-if)#
TestSwitch(config-if)#switchport access vlan 20
TestSwitch(config-if)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan20, changed state to up

TestSwitch(config-if)#
TestSwitch(config-if)#
TestSwitch(config-if)#exit
TestSwitch(config)#
TestSwitch(config)#
TestSwitch(config)#int f0/4
TestSwitch(config-if)#
TestSwitch(config-if)#
TestSwitch(config-if)#switchport mode access
TestSwitch(config-if)#
TestSwitch(config-if)#switchport access vlan 20
TestSwitch(config-if)#end
TestSwitch#
%SYS-5-CONFIG_I: Configured from console by console

TestSwitch#
TestSwitch#write memory
Building configuration...
[OK]
TestSwitch#
TestSwitch#
TestSwitch#
TestSwitch#
TestSwitch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
TestSwitch(config)#
TestSwitch(config)#interface FastEthernet0/24
TestSwitch(config-if)#
TestSwitch(config-if)#switchport mode trunk
TestSwitch(config-if)#
TestSwitch(config-if)#switchport trunk allowed vlan 10,20
TestSwitch(config-if)#
TestSwitch(config-if)#
TestSwitch(config-if)#end
TestSwitch#
%SYS-5-CONFIG_I: Configured from console by console

TestSwitch#
TestSwitch#write memory
Building configuration...
[OK]
TestSwitch#
TestSwitch#show run
Building configuration...

Current configuration : 1601 bytes
!
version 15.0
no service timestamps log datetime msec
no service timestamps debug datetime msec
service password-encryption
!
hostname TestSwitch
!
enable password 7 0822455D0A16
!
!
!
!
username admin privilege 1 password 7 0822455D0A16
!
!
!
spanning-tree mode pvst
spanning-tree extend system-id
!
interface FastEthernet0/1
 switchport access vlan 10
 switchport mode access
!
interface FastEthernet0/2
 switchport access vlan 10
 switchport mode access
!
interface FastEthernet0/3
 switchport access vlan 20
 switchport mode access
!
interface FastEthernet0/4
 switchport access vlan 20
 switchport mode access
!
interface FastEthernet0/5
!
interface FastEthernet0/6
!
interface FastEthernet0/7
!
interface FastEthernet0/8
!
interface FastEthernet0/9
!
interface FastEthernet0/10
!
interface FastEthernet0/11
!
interface FastEthernet0/12
!
interface FastEthernet0/13
!
interface FastEthernet0/14
!
interface FastEthernet0/15
!
interface FastEthernet0/16
!
interface FastEthernet0/17
!
interface FastEthernet0/18
!
interface FastEthernet0/19
!
interface FastEthernet0/20
!
interface FastEthernet0/21
!
interface FastEthernet0/22
!
interface FastEthernet0/23
!
interface FastEthernet0/24
 switchport trunk allowed vlan 10,20
 switchport mode trunk
 switchport nonegotiate
!
interface GigabitEthernet0/1
!
interface GigabitEthernet0/2
!
interface Vlan1
 no ip address
 shutdown
!
interface Vlan10
 ip address 10.0.10.100 255.255.255.0
!
interface Vlan20
 ip address 10.0.20.100 255.255.255.0
!
!
!
!
line con 0
 password 7 0822455D0A16
 login
!
line vty 0 4
 login
line vty 5 15
 login
!
!
!
!
end


TestSwitch#
TestSwitch#


# VLAN内での通信の設定
-------------------------------------------------------------------------------
# VLAN間での通信の設定


Switch#
Switch#
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Switch(config)#hostname router 
router(config)#
router(config)#
router(config)#username test1 password cisco
router(config)#
router(config)#enable password cisco
router(config)#service password-encryption
router(config)#
router(config)#
router(config)#line console 0
router(config-line)#
router(config-line)#password cisco
router(config-line)#
router(config-line)#login
router(config-line)#
router(config-line)#exit
router(config)#exit
router#
%SYS-5-CONFIG_I: Configured from console by console

router#
router#write memory
Building configuration...
[OK]
router#
router#
router#
router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
router(config)#
router(config)#interface GigabitEthernet0/1
router(config-if)#
router(config-if)#no shutdown
router(config-if)#
router(config-if)#exit
router(config)#
router(config)#
router(config)#
router(config)#vlan 10
router(config-vlan)#
router(config-vlan)#exit
router(config)#
router(config)#vlan 20
router(config-vlan)#
router(config-vlan)#exit
router(config)#
router(config)#
router(config)#exit
router#
%SYS-5-CONFIG_I: Configured from console by console

router#
router#
router#show vlan

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/1, Fa0/2, Fa0/3, Fa0/4
                                                Fa0/5, Fa0/6, Fa0/7, Fa0/8
                                                Fa0/9, Fa0/10, Fa0/11, Fa0/12
                                                Fa0/13, Fa0/14, Fa0/15, Fa0/16
                                                Fa0/17, Fa0/18, Fa0/19, Fa0/20
                                                Fa0/21, Fa0/22, Fa0/23, Fa0/24
                                                Gig0/1, Gig0/2
10   VLAN0010                         active    
20   VLAN0020                         active    
1002 fddi-default                     active    
1003 token-ring-default               active    
1004 fddinet-default                  active    
1005 trnet-default                    active    

VLAN Type  SAID       MTU   Parent RingNo BridgeNo Stp  BrdgMode Trans1 Trans2
---- ----- ---------- ----- ------ ------ -------- ---- -------- ------ ------
1    enet  100001     1500  -      -      -        -    -        0      0
10   enet  100010     1500  -      -      -        -    -        0      0
20   enet  100020     1500  -      -      -        -    -        0      0
1002 fddi  101002     1500  -      -      -        -    -        0      0   
1003 tr    101003     1500  -      -      -        -    -        0      0   
1004 fdnet 101004     1500  -      -      -        ieee -        0      0   
1005 trnet 101005     1500  -      -      -        ibm  -        0      0   

VLAN Type  SAID       MTU   Parent RingNo BridgeNo Stp  BrdgMode Trans1 Trans2
---- ----- ---------- ----- ------ ------ -------- ---- -------- ------ ------

Remote SPAN VLANs
------------------------------------------------------------------------------

Primary Secondary Type              Ports
------- --------- ----------------- ------------------------------------------
router#
router#
router#
router#
router#
router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
router(config)#
router(config)#interface GigabitEthernet0/1
router(config-if)#
router(config-if)#switchport mode trunk
Command rejected: An interface whose trunk encapsulation is "Auto" can not be configured to "trunk" mode.
router(config-if)#
router(config-if)#
router(config-if)#switchport trunk allowed vlan 10,20
router(config-if)#
router(config-if)#
router(config-if)#exit
router(config)#
router(config)#
router(config)#interface Vlan10
router(config-if)#
%LINK-5-CHANGED: Interface Vlan10, changed state to up

router(config-if)#
router(config-if)#ip address 10.0.10.254 255.255.255.0
router(config-if)#
router(config-if)#exit
router(config)#
router(config)#interface Vlan20
router(config-if)#
%LINK-5-CHANGED: Interface Vlan20, changed state to up

router(config-if)#
router(config-if)#ip address 10.0.20.254 255.255.255.0
router(config-if)#
router(config-if)#
router(config-if)#exit
router(config)#
router(config)#ip routing
router(config)#
router(config)#
router(config)#exit
router#
%SYS-5-CONFIG_I: Configured from console by console

router#
router#show run
Building configuration...

Current configuration : 1459 bytes
!
version 12.2(37)SE1
no service timestamps log datetime msec
no service timestamps debug datetime msec
service password-encryption
!
hostname router
!
!
enable password 7 0822455D0A16
!
!
!
!
!
ip routing
!
!
!
!
username test1 password 7 0822455D0A16
!
!
!
!
!
!
!
!
!
!
!
!
spanning-tree mode pvst
!
!
!
!
!
!
interface FastEthernet0/1
!
interface FastEthernet0/2
!
interface FastEthernet0/3
!
interface FastEthernet0/4
!
interface FastEthernet0/5
!
interface FastEthernet0/6
!
interface FastEthernet0/7
!
interface FastEthernet0/8
!
interface FastEthernet0/9
!
interface FastEthernet0/10
!
interface FastEthernet0/11
!
interface FastEthernet0/12
!
interface FastEthernet0/13
!
interface FastEthernet0/14
!
interface FastEthernet0/15
!
interface FastEthernet0/16
!
interface FastEthernet0/17
!
interface FastEthernet0/18
!
interface FastEthernet0/19
!
interface FastEthernet0/20
!
interface FastEthernet0/21
!
interface FastEthernet0/22
!
interface FastEthernet0/23
!
interface FastEthernet0/24
!
interface GigabitEthernet0/1
 switchport trunk allowed vlan 10,20
!
interface GigabitEthernet0/2
!
interface Vlan1
 no ip address
 shutdown
!
interface Vlan10
 mac-address 0060.4726.6a01
 ip address 10.0.10.254 255.255.255.0
!
interface Vlan20
 mac-address 0060.4726.6a02
 ip address 10.0.20.254 255.255.255.0
!
ip classless
!
ip flow-export version 9
!
!
!
!
!
!
!
!
line con 0
 password 7 0822455D0A16
 login
!
line aux 0
!
line vty 0 4
 login
!
!
!
!
end


router#
router#
router#write memory
Building configuration...
[OK]
router#




